/**
 * Created by Dell on 2015/10/14.
 */
var city_data = {
    hot: [
        {
            'pid': 110000,
            'pname': '北京',
            'id': 110100,
            'name': '北京市'
        },
        {
            'pid': 310000,
            'pname': '上海',
            'id': 310100,
            'name': '上海市'
        },
        {
            'pid': 440000,
            'pname': '广东',
            'id': 440100,
            'name': '广州市'
        },
        {
            'pid': 440000,
            'pname': '广东',
            'id': 440300,
            'name': '深圳市'
        },
        {
            'pid': 320000,
            'pname': '江苏',
            'id': 320100,
            'name': '南京市'
        }
    ],
    province: [
        {
            "id": 110000,
            "name": "北京",
            "city": [
                {
                    "id": 110100,
                    "name": "北京市"
                }
            ]
        },
        {
            "id": 210000,
            "name": "辽宁",
            "city": [
                {
                    "id": 210100,
                    "name": "沈阳市"
                },
                {
                    "id": 211200,
                    "name": "铁岭市"
                },
                {
                    "id": 211100,
                    "name": "盘锦市"
                },
                {
                    "id": 211000,
                    "name": "辽阳市"
                },
                {
                    "id": 210700,
                    "name": "锦州市"
                },
                {
                    "id": 211400,
                    "name": "葫芦岛市"
                },
                {
                    "id": 210900,
                    "name": "阜新市"
                },
                {
                    "id": 210400,
                    "name": "抚顺市"
                },
                {
                    "id": 210600,
                    "name": "丹东市"
                },
                {
                    "id": 210200,
                    "name": "大连市"
                },
                {
                    "id": 211300,
                    "name": "朝阳市"
                },
                {
                    "id": 210500,
                    "name": "本溪市"
                },
                {
                    "id": 210300,
                    "name": "鞍山市"
                },
                {
                    "id": 210800,
                    "name": "营口市"
                }
            ]
        },
        {
            "id": 150000,
            "name": "内蒙古",
            "city": [
                {
                    "id": 150100,
                    "name": "呼和浩特市"
                },
                {
                    "id": 152500,
                    "name": "锡林郭勒盟"
                },
                {
                    "id": 150900,
                    "name": "乌兰察布市"
                },
                {
                    "id": 150300,
                    "name": "乌海市"
                },
                {
                    "id": 150500,
                    "name": "通辽市"
                },
                {
                    "id": 150700,
                    "name": "呼伦贝尔市"
                },
                {
                    "id": 150600,
                    "name": "鄂尔多斯市"
                },
                {
                    "id": 150400,
                    "name": "赤峰市"
                },
                {
                    "id": 150200,
                    "name": "包头市"
                },
                {
                    "id": 150800,
                    "name": "巴彦淖尔市"
                },
                {
                    "id": 152900,
                    "name": "阿拉善盟"
                },
                {
                    "id": 152200,
                    "name": "兴安盟"
                }
            ]
        },
        {
            "id": 640000,
            "name": "宁夏",
            "city": [
                {
                    "id": 640100,
                    "name": "银川市"
                },
                {
                    "id": 640400,
                    "name": "固原市"
                },
                {
                    "id": 640200,
                    "name": "石嘴山市"
                },
                {
                    "id": 640300,
                    "name": "吴忠市"
                },
                {
                    "id": 640500,
                    "name": "中卫市"
                }
            ]
        },
        {
            "id": 630000,
            "name": "青海",
            "city": [
                {
                    "id": 630100,
                    "name": "西宁市"
                },
                {
                    "id": 632600,
                    "name": "果洛藏族自治州"
                },
                {
                    "id": 632200,
                    "name": "海北藏族自治州"
                },
                {
                    "id": 630200,
                    "name": "海东市"
                },
                {
                    "id": 632500,
                    "name": "海南藏族自治州"
                },
                {
                    "id": 632800,
                    "name": "海西蒙古族藏族自治州"
                },
                {
                    "id": 632300,
                    "name": "黄南藏族自治州"
                },
                {
                    "id": 632700,
                    "name": "玉树藏族自治州"
                }
            ]
        },
        {
            "id": 370000,
            "name": "山东",
            "city": [
                {
                    "id": 370100,
                    "name": "济南市"
                },
                {
                    "id": 370400,
                    "name": "枣庄市"
                },
                {
                    "id": 370600,
                    "name": "烟台市"
                },
                {
                    "id": 370700,
                    "name": "潍坊市"
                },
                {
                    "id": 371000,
                    "name": "威海市"
                },
                {
                    "id": 370900,
                    "name": "泰安市"
                },
                {
                    "id": 371100,
                    "name": "日照市"
                },
                {
                    "id": 370200,
                    "name": "青岛市"
                },
                {
                    "id": 371300,
                    "name": "临沂市"
                },
                {
                    "id": 371500,
                    "name": "聊城市"
                },
                {
                    "id": 371200,
                    "name": "莱芜市"
                },
                {
                    "id": 370800,
                    "name": "济宁市"
                },
                {
                    "id": 371700,
                    "name": "菏泽市"
                },
                {
                    "id": 370500,
                    "name": "东营市"
                },
                {
                    "id": 371400,
                    "name": "德州市"
                },
                {
                    "id": 371600,
                    "name": "滨州市"
                },
                {
                    "id": 370300,
                    "name": "淄博市"
                }
            ]
        },
        {
            "id": 140000,
            "name": "山西",
            "city": [
                {
                    "id": 140100,
                    "name": "太原市"
                },
                {
                    "id": 140300,
                    "name": "阳泉市"
                },
                {
                    "id": 140900,
                    "name": "忻州市"
                },
                {
                    "id": 140600,
                    "name": "朔州市"
                },
                {
                    "id": 141100,
                    "name": "吕梁市"
                },
                {
                    "id": 141000,
                    "name": "临汾市"
                },
                {
                    "id": 140700,
                    "name": "晋中市"
                },
                {
                    "id": 140500,
                    "name": "晋城市"
                },
                {
                    "id": 140200,
                    "name": "大同市"
                },
                {
                    "id": 140400,
                    "name": "长治市"
                },
                {
                    "id": 140800,
                    "name": "运城市"
                }
            ]
        },
        {
            "id": 610000,
            "name": "陕西",
            "city": [
                {
                    "id": 610100,
                    "name": "西安市"
                },
                {
                    "id": 610600,
                    "name": "延安市"
                },
                {
                    "id": 610400,
                    "name": "咸阳市"
                },
                {
                    "id": 610500,
                    "name": "渭南市"
                },
                {
                    "id": 610200,
                    "name": "铜川市"
                },
                {
                    "id": 611000,
                    "name": "商洛市"
                },
                {
                    "id": 610700,
                    "name": "汉中市"
                },
                {
                    "id": 610300,
                    "name": "宝鸡市"
                },
                {
                    "id": 610900,
                    "name": "安康市"
                },
                {
                    "id": 610800,
                    "name": "榆林市"
                }
            ]
        },
        {
            "id": 510000,
            "name": "四川",
            "city": [
                {
                    "id": 510100,
                    "name": "成都市"
                },
                {
                    "id": 510700,
                    "name": "绵阳市"
                },
                {
                    "id": 511000,
                    "name": "内江市"
                },
                {
                    "id": 511300,
                    "name": "南充市"
                },
                {
                    "id": 510400,
                    "name": "攀枝花市"
                },
                {
                    "id": 510900,
                    "name": "遂宁市"
                },
                {
                    "id": 511800,
                    "name": "雅安市"
                },
                {
                    "id": 511500,
                    "name": "宜宾市"
                },
                {
                    "id": 512000,
                    "name": "资阳市"
                },
                {
                    "id": 511400,
                    "name": "眉山市"
                },
                {
                    "id": 510500,
                    "name": "泸州市"
                },
                {
                    "id": 513400,
                    "name": "凉山彝族自治州"
                },
                {
                    "id": 513200,
                    "name": "阿坝藏族羌族自治州"
                },
                {
                    "id": 511900,
                    "name": "巴中市"
                },
                {
                    "id": 511700,
                    "name": "达州市"
                },
                {
                    "id": 510600,
                    "name": "德阳市"
                },
                {
                    "id": 513300,
                    "name": "甘孜藏族自治州"
                },
                {
                    "id": 511600,
                    "name": "广安市"
                },
                {
                    "id": 510800,
                    "name": "广元市"
                },
                {
                    "id": 511100,
                    "name": "乐山市"
                },
                {
                    "id": 510300,
                    "name": "自贡市"
                }
            ]
        },
        {
            "id": 540000,
            "name": "西藏",
            "city": [
                {
                    "id": 540100,
                    "name": "拉萨市"
                },
                {
                    "id": 542500,
                    "name": "阿里地区"
                },
                {
                    "id": 542100,
                    "name": "昌都地区"
                },
                {
                    "id": 542600,
                    "name": "林芝地区"
                },
                {
                    "id": 542400,
                    "name": "那曲地区"
                },
                {
                    "id": 542300,
                    "name": "日喀则地区"
                },
                {
                    "id": 542200,
                    "name": "山南地区"
                }
            ]
        },
        {
            "id": 650000,
            "name": "新疆",
            "city": [
                {
                    "id": 650100,
                    "name": "乌鲁木齐市"
                },
                {
                    "id": 659004,
                    "name": "五家渠市"
                },
                {
                    "id": 652100,
                    "name": "吐鲁番地区"
                },
                {
                    "id": 659003,
                    "name": "图木舒克市"
                },
                {
                    "id": 654200,
                    "name": "塔城地区"
                },
                {
                    "id": 659001,
                    "name": "石河子市"
                },
                {
                    "id": 653000,
                    "name": "克孜勒苏柯尔克孜自治州"
                },
                {
                    "id": 650200,
                    "name": "克拉玛依市"
                },
                {
                    "id": 653100,
                    "name": "喀什地区"
                },
                {
                    "id": 653200,
                    "name": "和田地区"
                },
                {
                    "id": 652200,
                    "name": "哈密地区"
                },
                {
                    "id": 652300,
                    "name": "昌吉回族自治州"
                },
                {
                    "id": 652700,
                    "name": "博尔塔拉蒙古自治州"
                },
                {
                    "id": 652800,
                    "name": "巴音郭楞蒙古自治州"
                },
                {
                    "id": 654300,
                    "name": "阿勒泰地区"
                },
                {
                    "id": 659002,
                    "name": "阿拉尔市"
                },
                {
                    "id": 652900,
                    "name": "阿克苏地区"
                },
                {
                    "id": 654000,
                    "name": "伊犁哈萨克自治州"
                }
            ]
        },
        {
            "id": 530000,
            "name": "云南",
            "city": [
                {
                    "id": 530100,
                    "name": "昆明市"
                },
                {
                    "id": 530600,
                    "name": "昭通市"
                },
                {
                    "id": 530400,
                    "name": "玉溪市"
                },
                {
                    "id": 532800,
                    "name": "西双版纳傣族自治州"
                },
                {
                    "id": 532600,
                    "name": "文山壮族苗族自治州"
                },
                {
                    "id": 530800,
                    "name": "思茅市"
                },
                {
                    "id": 530300,
                    "name": "曲靖市"
                },
                {
                    "id": 533300,
                    "name": "怒江傈僳族自治州"
                },
                {
                    "id": 530900,
                    "name": "临沧市"
                },
                {
                    "id": 530700,
                    "name": "丽江市"
                },
                {
                    "id": 532500,
                    "name": "红河哈尼族彝族自治州"
                },
                {
                    "id": 533400,
                    "name": "迪庆藏族自治州"
                },
                {
                    "id": 533100,
                    "name": "德宏傣族景颇族自治州"
                },
                {
                    "id": 532900,
                    "name": "大理白族自治州"
                },
                {
                    "id": 532300,
                    "name": "楚雄彝族自治州"
                },
                {
                    "id": 530500,
                    "name": "保山市"
                },
                {
                    "id": 530800,
                    "name": "普洱市"
                }
            ]
        },
        {
            "id": 330000,
            "name": "浙江",
            "city": [
                {
                    "id": 330100,
                    "name": "杭州市"
                },
                {
                    "id": 330300,
                    "name": "温州市"
                },
                {
                    "id": 331000,
                    "name": "台州市"
                },
                {
                    "id": 330600,
                    "name": "绍兴市"
                },
                {
                    "id": 330800,
                    "name": "衢州市"
                },
                {
                    "id": 330200,
                    "name": "宁波市"
                },
                {
                    "id": 331100,
                    "name": "丽水市"
                },
                {
                    "id": 330700,
                    "name": "金华市"
                },
                {
                    "id": 330400,
                    "name": "嘉兴市"
                },
                {
                    "id": 330500,
                    "name": "湖州市"
                },
                {
                    "id": 330900,
                    "name": "舟山市"
                }
            ]
        },
        {
            "id": 810000,
            "name": "香港",
            "city": [
                {
                    "id": 810100,
                    "name": "香港特别行政区"
                }
            ]
        },
        {
            "id": 820000,
            "name": "澳门",
            "city": [
                {
                    "id": 820100,
                    "name": "澳门特别行政区"
                }
            ]
        },
        {
            "id": 710000,
            "name": "台湾",
            "city": [
                {
                    "id": 710100,
                    "name": "台北市"
                }/*,
                {
                    "id": 3256,
                    "name": "台东县"
                },
                {
                    "id": 3257,
                    "name": "台南市"
                },
                {
                    "id": 3258,
                    "name": "台南县"
                },
                {
                    "id": 3259,
                    "name": "台中市"
                },
                {
                    "id": 3260,
                    "name": "台中县"
                },
                {
                    "id": 3261,
                    "name": "桃园县"
                },
                {
                    "id": 3262,
                    "name": "新竹市"
                },
                {
                    "id": 3263,
                    "name": "新竹县"
                },
                {
                    "id": 3264,
                    "name": "宜兰县"
                },
                {
                    "id": 3265,
                    "name": "云林县"
                },
                {
                    "id": 3255,
                    "name": "台北县"
                },
                {
                    "id": 3254,
                    "name": "屏东县"
                },
                {
                    "id": 3244,
                    "name": "高雄市"
                },
                {
                    "id": 3245,
                    "name": "高雄县"
                },
                {
                    "id": 3246,
                    "name": "花莲县"
                },
                {
                    "id": 3247,
                    "name": "基隆市"
                },
                {
                    "id": 3248,
                    "name": "嘉义市"
                },
                {
                    "id": 3249,
                    "name": "嘉义县"
                },
                {
                    "id": 3250,
                    "name": "金门县"
                },
                {
                    "id": 3251,
                    "name": "苗栗县"
                },
                {
                    "id": 3252,
                    "name": "南投县"
                },
                {
                    "id": 3253,
                    "name": "澎湖县"
                },
                {
                    "id": 3266,
                    "name": "彰化县"
                }*/
            ]
        },
        {
            "id": 360000,
            "name": "江西",
            "city": [
                {
                    "id": 360100,
                    "name": "南昌市"
                },
                {
                    "id": 360900,
                    "name": "宜春市"
                },
                {
                    "id": 360500,
                    "name": "新余市"
                },
                {
                    "id": 361100,
                    "name": "上饶市"
                },
                {
                    "id": 360300,
                    "name": "萍乡市"
                },
                {
                    "id": 360400,
                    "name": "九江市"
                },
                {
                    "id": 360200,
                    "name": "景德镇市"
                },
                {
                    "id": 360800,
                    "name": "吉安市"
                },
                {
                    "id": 360700,
                    "name": "赣州市"
                },
                {
                    "id": 361000,
                    "name": "抚州市"
                },
                {
                    "id": 360600,
                    "name": "鹰潭市"
                }
            ]
        },
        {
            "id": 320000,
            "name": "江苏",
            "city": [
                {
                    "id": 320100,
                    "name": "南京市"
                },
                {
                    "id": 321000,
                    "name": "扬州市"
                },
                {
                    "id": 320900,
                    "name": "盐城市"
                },
                {
                    "id": 320300,
                    "name": "徐州市"
                },
                {
                    "id": 320200,
                    "name": "无锡市"
                },
                {
                    "id": 321200,
                    "name": "泰州市"
                },
                {
                    "id": 321300,
                    "name": "宿迁市"
                },
                {
                    "id": 320500,
                    "name": "苏州市"
                },
                {
                    "id": 320600,
                    "name": "南通市"
                },
                {
                    "id": 320700,
                    "name": "连云港市"
                },
                {
                    "id": 320800,
                    "name": "淮安市"
                },
                {
                    "id": 320400,
                    "name": "常州市"
                },
                {
                    "id": 321100,
                    "name": "镇江市"
                }
            ]
        },
        {
            "id": 310000,
            "name": "上海",
            "city": [
                {
                    "id": 310100,
                    "name": "上海市"
                }
            ]
        },
        {
            "id": 120000,
            "name": "天津",
            "city": [
                {
                    "id": 120100,
                    "name": "天津市"
                }
            ]
        },
        {
            "id": 500000,
            "name": "重庆",
            "city": [
                {
                    "id": 500100,
                    "name": "重庆市"
                }
            ]
        },
        {
            "id": 340000,
            "name": "安徽",
            "city": [
                {
                    "id": 340100,
                    "name": "合肥市"
                },
                {
                    "id": 340200,
                    "name": "芜湖市"
                },
                {
                    "id": 340700,
                    "name": "铜陵市"
                },
                {
                    "id": 341300,
                    "name": "宿州市"
                },
                {
                    "id": 340500,
                    "name": "马鞍山市"
                },
                {
                    "id": 341500,
                    "name": "六安市"
                },
                {
                    "id": 341000,
                    "name": "黄山市"
                },
                {
                    "id": 340400,
                    "name": "淮南市"
                },
                {
                    "id": 340600,
                    "name": "淮北市"
                },
                {
                    "id": 341200,
                    "name": "阜阳市"
                },
                {
                    "id": 341100,
                    "name": "滁州市"
                },
                {
                    "id": 341700,
                    "name": "池州市"
                },
                {
                    "id": 341400,
                    "name": "巢湖市"
                },
                {
                    "id": 341600,
                    "name": "亳州市"
                },
                {
                    "id": 340300,
                    "name": "蚌埠市"
                },
                {
                    "id": 340800,
                    "name": "安庆市"
                },
                {
                    "id": 341800,
                    "name": "宣城市"
                }
            ]
        },
        {
            "id": 350000,
            "name": "福建",
            "city": [
                {
                    "id": 350100,
                    "name": "福州市"
                },
                {
                    "id": 350800,
                    "name": "龙岩市"
                },
                {
                    "id": 350700,
                    "name": "南平市"
                },
                {
                    "id": 350900,
                    "name": "宁德市"
                },
                {
                    "id": 350300,
                    "name": "莆田市"
                },
                {
                    "id": 350500,
                    "name": "泉州市"
                },
                {
                    "id": 350400,
                    "name": "三明市"
                },
                {
                    "id": 350200,
                    "name": "厦门市"
                },
                {
                    "id": 350600,
                    "name": "漳州市"
                }
            ]
        },
        {
            "id": 620000,
            "name": "甘肃",
            "city": [
                {
                    "id": 620100,
                    "name": "兰州市"
                },
                {
                    "id": 620600,
                    "name": "武威市"
                },
                {
                    "id": 620500,
                    "name": "天水市"
                },
                {
                    "id": 621000,
                    "name": "庆阳市"
                },
                {
                    "id": 620800,
                    "name": "平凉市"
                },
                {
                    "id": 621200,
                    "name": "陇南市"
                },
                {
                    "id": 622900,
                    "name": "临夏回族自治州"
                },
                {
                    "id": 620900,
                    "name": "酒泉市"
                },
                {
                    "id": 620300,
                    "name": "金昌市"
                },
                {
                    "id": 620200,
                    "name": "嘉峪关市"
                },
                {
                    "id": 623000,
                    "name": "甘南藏族自治州"
                },
                {
                    "id": 621100,
                    "name": "定西市"
                },
                {
                    "id": 620400,
                    "name": "白银市"
                },
                {
                    "id": 620700,
                    "name": "张掖市"
                }
            ]
        },
        {
            "id": 440000,
            "name": "广东",
            "city": [
                {
                    "id": 440100,
                    "name": "广州市"
                },
                {
                    "id": 440500,
                    "name": "汕头市"
                },
                {
                    "id": 441500,
                    "name": "汕尾市"
                },
                {
                    "id": 440200,
                    "name": "韶关市"
                },
                {
                    "id": 440300,
                    "name": "深圳市"
                },
                {
                    "id": 441700,
                    "name": "阳江市"
                },
                {
                    "id": 445300,
                    "name": "云浮市"
                },
                {
                    "id": 440800,
                    "name": "湛江市"
                },
                {
                    "id": 441200,
                    "name": "肇庆市"
                },
                {
                    "id": 442000,
                    "name": "中山市"
                },
                {
                    "id": 441800,
                    "name": "清远市"
                },
                {
                    "id": 441400,
                    "name": "梅州市"
                },
                {
                    "id": 445100,
                    "name": "潮州市"
                },
                {
                    "id": 441900,
                    "name": "东莞市"
                },
                {
                    "id": 440600,
                    "name": "佛山市"
                },
                {
                    "id": 441600,
                    "name": "河源市"
                },
                {
                    "id": 441300,
                    "name": "惠州市"
                },
                {
                    "id": 440700,
                    "name": "江门市"
                },
                {
                    "id": 445200,
                    "name": "揭阳市"
                },
                {
                    "id": 440900,
                    "name": "茂名市"
                },
                {
                    "id": 440400,
                    "name": "珠海市"
                }
            ]
        },
        {
            "id": 450000,
            "name": "广西",
            "city": [
                {
                    "id": 450100,
                    "name": "南宁市"
                },
                {
                    "id": 450400,
                    "name": "梧州市"
                },
                {
                    "id": 450700,
                    "name": "钦州市"
                },
                {
                    "id": 450200,
                    "name": "柳州市"
                },
                {
                    "id": 451300,
                    "name": "来宾市"
                },
                {
                    "id": 451100,
                    "name": "贺州市"
                },
                {
                    "id": 451200,
                    "name": "河池市"
                },
                {
                    "id": 450300,
                    "name": "桂林市"
                },
                {
                    "id": 450800,
                    "name": "贵港市"
                },
                {
                    "id": 450600,
                    "name": "防城港市"
                },
                {
                    "id": 451400,
                    "name": "崇左市"
                },
                {
                    "id": 450500,
                    "name": "北海市"
                },
                {
                    "id": 451000,
                    "name": "百色市"
                },
                {
                    "id": 450900,
                    "name": "玉林市"
                }
            ]
        },
        {
            "id": 520000,
            "name": "贵州",
            "city": [
                {
                    "id": 520100,
                    "name": "贵阳市"
                },
                {
                    "id": 520400,
                    "name": "安顺市"
                },
                {
                    "id": 522400,
                    "name": "毕节地区"
                },
                {
                    "id": 520200,
                    "name": "六盘水市"
                },
                {
                    "id": 522600,
                    "name": "黔东南苗族侗族自治州"
                },
                {
                    "id": 522700,
                    "name": "黔南布依族苗族自治州"
                },
                {
                    "id": 522300,
                    "name": "黔西南布依族苗族自治州"
                },
                {
                    "id": 522200,
                    "name": "铜仁地区"
                },
                {
                    "id": 520300,
                    "name": "遵义市"
                }
            ]
        },
        {
            "id": 460000,
            "name": "海南",
            "city": [
                {
                    "id": 460100,
                    "name": "海口市"
                },
                {
                    "id": 460200,
                    "name": "三亚市"
                },
                {
                    "id": 469000,
                    "name": "省直辖县级行政单位"
                }
            ]
        },
        {
            "id": 130000,
            "name": "河北",
            "city": [
                {
                    "id": 130100,
                    "name": "石家庄市"
                },
                {
                    "id": 130500,
                    "name": "邢台市"
                },
                {
                    "id": 130200,
                    "name": "唐山市"
                },
                {
                    "id": 130300,
                    "name": "秦皇岛市"
                },
                {
                    "id": 131000,
                    "name": "廊坊市"
                },
                {
                    "id": 131100,
                    "name": "衡水市"
                },
                {
                    "id": 130400,
                    "name": "邯郸市"
                },
                {
                    "id": 130800,
                    "name": "承德市"
                },
                {
                    "id": 130900,
                    "name": "沧州市"
                },
                {
                    "id": 130600,
                    "name": "保定市"
                },
                {
                    "id": 130700,
                    "name": "张家口市"
                }
            ]
        },
        {
            "id": 410000,
            "name": "河南",
            "city": [
                {
                    "id": 410100,
                    "name": "郑州市"
                },
                {
                    "id": 411600,
                    "name": "周口市"
                },
                {
                    "id": 411000,
                    "name": "许昌市"
                },
                {
                    "id": 411500,
                    "name": "信阳市"
                },
                {
                    "id": 410700,
                    "name": "新乡市"
                },
                {
                    "id": 411400,
                    "name": "商丘市"
                },
                {
                    "id": 411200,
                    "name": "三门峡市"
                },
                {
                    "id": 410900,
                    "name": "濮阳市"
                },
                {
                    "id": 410400,
                    "name": "平顶山市"
                },
                {
                    "id": 411300,
                    "name": "南阳市"
                },
                {
                    "id": 411100,
                    "name": "漯河市"
                },
                {
                    "id": 410300,
                    "name": "洛阳市"
                },
                {
                    "id": 410200,
                    "name": "开封市"
                },
                {
                    "id": 410800,
                    "name": "焦作市"
                },
                {
                    "id": 419001,
                    "name": "济源市"
                },
                {
                    "id": 410600,
                    "name": "鹤壁市"
                },
                {
                    "id": 410500,
                    "name": "安阳市"
                },
                {
                    "id": 411700,
                    "name": "驻马店市"
                }
            ]
        },
        {
            "id": 230000,
            "name": "黑龙江",
            "city": [
                {
                    "id": 230100,
                    "name": "哈尔滨市"
                },
                {
                    "id": 231200,
                    "name": "绥化市"
                },
                {
                    "id": 230500,
                    "name": "双鸭山市"
                },
                {
                    "id": 230200,
                    "name": "齐齐哈尔市"
                },
                {
                    "id": 230900,
                    "name": "七台河市"
                },
                {
                    "id": 231000,
                    "name": "牡丹江市"
                },
                {
                    "id": 230800,
                    "name": "佳木斯市"
                },
                {
                    "id": 230300,
                    "name": "鸡西市"
                },
                {
                    "id": 231100,
                    "name": "黑河市"
                },
                {
                    "id": 230400,
                    "name": "鹤岗市"
                },
                {
                    "id": 232700,
                    "name": "大兴安岭地区"
                },
                {
                    "id": 230600,
                    "name": "大庆市"
                },
                {
                    "id": 230700,
                    "name": "伊春市"
                }
            ]
        },
        {
            "id": 420000,
            "name": "湖北",
            "city": [
                {
                    "id": 420100,
                    "name": "武汉市"
                },
                {
                    "id": 420500,
                    "name": "宜昌市"
                },
                {
                    "id": 420900,
                    "name": "孝感市"
                },
                {
                    "id": 421200,
                    "name": "咸宁市"
                },
                {
                    "id": 429004,
                    "name": "仙桃市"
                },
                {
                    "id": 429006,
                    "name": "天门市"
                },
                {
                    "id": 421300,
                    "name": "随州市"
                },
                {
                    "id": 420300,
                    "name": "十堰市"
                },
                {
                    "id": 429021,
                    "name": "神农架林区"
                },
                {
                    "id": 429005,
                    "name": "潜江市"
                },
                {
                    "id": 421000,
                    "name": "荆州市"
                },
                {
                    "id": 420800,
                    "name": "荆门市"
                },
                {
                    "id": 420200,
                    "name": "黄石市"
                },
                {
                    "id": 421100,
                    "name": "黄冈市"
                },
                {
                    "id": 422800,
                    "name": "恩施土家族苗族自治州"
                },
                {
                    "id": 420700,
                    "name": "鄂州市"
                },
                {
                    "id": 420600,
                    "name": "襄阳市"
                }
            ]
        },
        {
            "id": 430000,
            "name": "湖南",
            "city": [
                {
                    "id": 430100,
                    "name": "长沙市"
                },
                {
                    "id": 430800,
                    "name": "张家界市"
                },
                {
                    "id": 430600,
                    "name": "岳阳市"
                },
                {
                    "id": 431100,
                    "name": "永州市"
                },
                {
                    "id": 430900,
                    "name": "益阳市"
                },
                {
                    "id": 433100,
                    "name": "湘西土家族苗族自治州"
                },
                {
                    "id": 430300,
                    "name": "湘潭市"
                },
                {
                    "id": 430500,
                    "name": "邵阳市"
                },
                {
                    "id": 431300,
                    "name": "娄底市"
                },
                {
                    "id": 431200,
                    "name": "怀化市"
                },
                {
                    "id": 430400,
                    "name": "衡阳市"
                },
                {
                    "id": 431000,
                    "name": "郴州市"
                },
                {
                    "id": 430700,
                    "name": "常德市"
                },
                {
                    "id": 430200,
                    "name": "株洲市"
                }
            ]
        },
        {
            "id": 220000,
            "name": "吉林",
            "city": [
                {
                    "id": 220100,
                    "name": "长春市"
                },
                {
                    "id": 220800,
                    "name": "白城市"
                },
                {
                    "id": 220600,
                    "name": "白山市"
                },
                {
                    "id": 220200,
                    "name": "吉林市"
                },
                {
                    "id": 220400,
                    "name": "辽源市"
                },
                {
                    "id": 220200,
                    "name": "四平市"
                },
                {
                    "id": 220700,
                    "name": "松原市"
                },
                {
                    "id": 220500,
                    "name": "通化市"
                },
                {
                    "id": 222400,
                    "name": "延边朝鲜族自治州"
                }
            ]
        }
    ]
};
/**
 * Author IIInsomnia
 *
 * var cityPicker = new HzwCityPicker({
 *      data: city_data,             城市数据
 *      target: 'cityChoice',   目标元素id（如：文本框，该值为城市名称）
 *      valType: 'k-v',         隐藏域的值类型（取值有：'k' => 只存ID，'k-v' => 存ID和名称，格式为：id-name）
 *      hideCityInput: {        城市隐藏域
 *          name: 'city',       隐藏域name
 *          id: 'city'          隐藏域id
 *          val: '2'            默认值
 *      },
 *      hideProvinceInput: {    省份隐藏域（如果不需要存省份，此项可以省略）
 *          name: 'province',   隐藏域name
 *          id: 'province'      隐藏域id
 *          val: '1'            默认值
 *      },
 *      callback: function(){   回调函数，选择城市后调用
 *          alert('OK');
 *      }
 * });
 *
 * cityPicker.init();
 */
eval(function(p, a, c, k, e, r) {
    e = function(c) {
        return (c < a ? '': e(parseInt(c / a))) + ((c = c % a) > 35 ? String.fromCharCode(c + 29) : c.toString(36))
    };
    if (!''.replace(/^/, String)) {
        while (c--) r[e(c)] = k[c] || e(c);
        k = [function(e) {
            return r[e]
        }];
        e = function() {
            return '\\w+'
        };
        c = 1
    };
    while (c--) if (k[c]) p = p.replace(new RegExp('\\b' + e(c) + '\\b', 'g'), k[c]);
    return p
} ('1O(1E(d,e,a,c,b,f){b=1E(a){1F(a<e?"":b(1I(a/e)))+(35<(a%=e)?1J.1P(a+29):a.1U(36))};1K(!"".1H(/^/,1J)){1G(;a--;)f[b(a)]=c[a]||b(a);c=[1E(a){1F f[a]}];b=1E(){1F"\\\\w+"};a=1}1G(;a--;)c[a]&&(d=d.1H(1M 1N("\\\\b"+b(a)+"\\\\b","g"),c[a]));1F d}(";1 Z=7(a){2.s=$(\'<n o=\\"5-q-1t\\" 6=\\"1o\\"><n o=\\"5-J-w\\"><p>\\1Q\\1R\\1S\\1T</p><z 6=\\"12\\"></z></n><n o=\\"1j\\"></n><n o=\\"5-w\\"><p>\\1V\\1W\\1X\\1L</p><z o=\\"5-m-w\\" 6=\\"18\\"></z></n></n>\');2.R=$(\'#12\',2.s);2.x=$(\'#18\',2.s);2.h={3:a.3,u:$(\'#\'+a.u),C:a.C||\'k\',1f:a.1f||Q};2.9=a.9?$(\'<1a>\',{16:\'14\',4:a.9.4,6:a.9.6,8:a.9.8||\'\'}):Q;2.r=$(\'<1a>\',{16:\'14\',4:a.r.4,6:a.r.6,8:a.r.8||\'\'});2.A=a.A||\'\';2.D=P};Z.1w={1z:7(){1 a=2;a.h.u.1i(a.r);l(a.9)a.h.u.1i(a.9);a.1h()},1g:7(){1 a=2;a.1d();a.11();a.X();a.1e();a.Y()},1d:7(){1 a=2;1 b=a.h.3.J;1 c=\'\';L(1 i=0,I=b.G;i<I;i++){c+=\'<B o=\\"5-J-q\\" 3-6=\\"\'+b[i][\'6\']+\'\\" 3-4=\\"\'+b[i][\'4\']+\'\\" 3-M=\\"\'+b[i][\'M\']+\'\\" 3-N=\\"\'+b[i][\'N\']+\'\\">\'+b[i][\'4\']+\'</B>\'}a.R.O(c)},11:7(){1 a=2;1 b=a.h.3.m;1 c=\'\';L(1 i=0,I=b.G;i<I;i++){c+=\'<B o=\\"5-m\\" 3-6=\\"\'+b[i][\'6\']+\'\\" 3-4=\\"\'+b[i][\'4\']+\'\\"><z o=\\"5-q-w\\"></z><n o=\\"5-m-4\\">\'+b[i][\'4\']+\'</n></B>\'}a.x.O(c)},10:7(a){1 b=2;1 c=a.3(\'6\');1 d=a.1v();1 e=b.h.3.m;1 f;1 g=\'\';L(1 i=0,17=e.G;i<17;i++){l(e[i][\'6\']==1s(c)){f=e[i][\'q\'];1r}}L(1 j=0,1b=f.G;j<1b;j++){g+=\'<B o=\\"5-q\\" 3-6=\\"\'+f[j][\'6\']+\'\\" 3-4=\\"\'+f[j][\'4\']+\'\\" 1q=\\"\'+f[j][\'4\']+\'\\">\'+f[j][\'4\']+\'</B>\'}a.y(\'.5-q-w\').O(g).U(\'K\',\'-\'+(d.K-1p)+\'1m\').1l()},X:7(){1 a=2;a.s.1k(7(){a.D=Q}).1u(7(){a.D=P})},1e:7(){1 b=2;b.x.T(\'S\',\'.5-m\',7(){1 a=$(2);l(!a.1n(\'t\')){b.x.y(\'.5-m\').H(\'t\');b.x.y(\'.5-m-4\').H(\'t\');b.x.y(\'.5-q-w\').1c().19().E();a.13(\'t\');a.y(\'.5-m-4\').13(\'t\');b.10(a)}F{a.H(\'t\');a.y(\'.5-m-4\').H(\'t\');a.y(\'.5-q-w\').1c().19().E()}})},Y:7(){1 g=2;g.R.T(\'S\',\'.5-J-q\',7(){1 a=$(2);1 b=a.3(\'6\');1 c=a.3(\'4\');g.h.u.8(c);l(g.h.C==\'k-v\'){g.r.8(b+\'-\'+c)}F{g.r.8(b)}l(g.9){1 d=a.3(\'M\');1 e=a.3(\'N\');l(g.h.C==\'k-v\'){g.9.8(d+\'-\'+e)}F{g.9.8(d)}}g.s.E();l(g.A)g.A()});g.x.T(\'S\',\'.5-q\',7(){1 a=$(2);1 b=a.3(\'6\');1 c=a.3(\'4\');g.h.u.8(c);l(g.h.C==\'k-v\'){g.r.8(b+\'-\'+c)}F{g.r.8(b)}l(g.9){1 d=a.W().W();1 e=d.3(\'6\');1 f=d.3(\'4\');l(g.h.C==\'k-v\'){g.9.8(e+\'-\'+f)}F{g.9.8(e)}}g.s.E();l(g.A)g.A()})},1h:7(){1 d=2;d.h.u.1x(7(){1 a=$(2);d.1g();1 b=a.1y();1 c=b.V+a.1A()+15;d.s.U({\'K\':b.K,\'V\':c});$(\'1B\').1C(d.s)}).1D(7(){l(d.D){d.s.E();d.D=P}})}};",1Y,1Z," 20 21 22 23 24 25 1E 26 27        28    1K 2a 2b 2c  2d 2e 2f 2g 2h  2i 2j 2k 2l 2m 2n 2o 2p 2q 2r 2s 2t 2u 2v 2w 1G 2x 2y 2z 2A 2B 2C 2D 2E 2F 2G 2H 2I 2J 2K 2L 2M 2N 2O 2P  2Q 2R 2S 2T 2U 2V 2W 2X 2Y 2Z 30 31 32 33 34 37 38 39 3a 3b 3c 3d 1I 3e 3f 3g 3h 3i 3j 3k 3l 3m 3n 3o".3p(" "),0,{}));', 62, 212, '||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||function|return|for|replace|parseInt|String|if|u4efd|new|RegExp|eval|fromCharCode|u70ed|u95e8|u57ce|u5e02|toString|u9009|u62e9|u7701|62|102|var|this|data|name|hzw|id|val|hideProvinceInput|settings||province|div|class|city|hideCityInput|template|active|target|wrap|province_wrap|find|ul|callback|li|valType|flag|remove|else|length|removeClass|len|hot|left|pid|pname|html|true|false|hot_city|click|on|css|top|parent|addMouseEvent|addCityEvent|HzwCityPicker|addCityTpl|addProvinceTpl|hzw_hot_city|addClass|hidden|type|plen|hzw_province_wrap|children|input|clen|hide|addHotCityTpl|addProvinceEvent|multiple|buildCityPicker|addTargetEvent|after|line|mouseenter|||show|px|hasClass|hzw_city_picker|53|title|break|picker|mouseleave|position|prototype|focus|offset|init|outerHeight|body|append|blur|split'.split('|'), 0, {}))